### pandas Series

* list와는 다르게 index를 따로 가진다.
* 날짜 값 등, 다양한 값 지정 가능
* 연산 시, index를 기준으로 값을 연산: 같은 index를 찾아서 연산

### pandas DataFrame

* series가 1차원 형태의 자료구조라면, DataFrame은 2차원 형태의 자료구조
* DataFrame을 만들 때, 요소의 개수가 같아야 한다.
* DataFrame에서 열 단위로 선택하면 Series가 반환된다.

In [79]:
import pandas as pd
import matplotlib as mpl
import matplotlib.pyplot as plt
import numpy as np

In [1]:
dict1 = { 'one':'하나', 'two':'둘', 'three':'셋'  }
dict2 = { 1:'하나', 2:'둘', 3:'셋' }
dict3 = { 'col1':[1,2,3], 'col2':['a', 'b', 'c']  }

In [2]:
print(dict1)
print(dict2)
print(dict3)

{'one': '하나', 'two': '둘', 'three': '셋'}
{1: '하나', 2: '둘', 3: '셋'}
{'col1': [1, 2, 3], 'col2': ['a', 'b', 'c']}

In [8]:
print('pandas:', pd.__version__)
print('matplotlib:',mpl.__version__)

pandas: 1.3.2
matplotlib: 3.4.2

In [9]:
score = pd.Series([1000, 14000, 3000, 30000, 10000])
print(score)

0     1000
1    14000
2     3000
3    30000
4    10000
dtype: int64

In [10]:
type(score)

pandas.core.series.Series

In [11]:
print(score.index)

RangeIndex(start=0, stop=5, step=1)

In [12]:
print(list(score.index))

[0, 1, 2, 3, 4]

In [13]:
print(score.values)

[ 1000 14000  3000 30000 10000]

In [14]:
print(type(score.index))

<class 'pandas.core.indexes.range.RangeIndex'>

In [15]:
print(type(list(score.index)))

<class 'list'>

In [16]:
print(type(score.values))

<class 'numpy.ndarray'>

In [18]:
score = pd.Series([1000, 14000, 3000], index=['2019-05-01', '2019-05-02', '2019-05-03'])
print(score)

2019-05-01     1000
2019-05-02    14000
2019-05-03     3000
dtype: int64

### Series를 만들기

In [19]:
score = pd.Series(['a', 'b', 'c'])
print(score)

0    a
1    b
2    c
dtype: object

In [21]:
score_idx = pd.Series(['a', 'b', 'c'],
                      index=['2021-09-16', '2021-09-17', '2021-09-18'])
print(score_idx)

2021-09-16    a
2021-09-17    b
2021-09-18    c
dtype: object

In [24]:
for idx in score.index:
    print(idx)

0
1
2

In [26]:
for value in score.values:
    print(value)

a
b
c

In [27]:
for idx in score_idx.index:
    print(idx)

2021-09-16
2021-09-17
2021-09-18

In [28]:
for value in score_idx.values:
    print(value)

a
b
c

In [30]:
# date_range
idx = pd.date_range(start="2020-01-01",end="2020-01-03").tolist()

score_idx = pd.Series( ['a', 'b', 'c'], 
                   index=idx )
score_idx

2020-01-01    a
2020-01-02    b
2020-01-03    c
dtype: object

In [97]:
gildong = pd.Series([1500, 3000, 2500, 1000],
                   index = ['2019-05-01', '2019-05-02', '2019-05-03', '2019-05-04'])
toto =  pd.Series([3000, 3000, 2000],
                   index = ['2019-05-01', '2019-05-03', '2019-05-02'])

In [100]:
dict_sum = {'gildong': gildong, 'toto': toto}
aa = pd.DataFrame(dict_sum)
aa

            gildong    toto
2019-05-01     1500  3000.0
2019-05-02     3000  2000.0
2019-05-03     2500  3000.0
2019-05-04     1000     NaN

In [98]:
gildong + toto

2019-05-01    4500.0
2019-05-02    5000.0
2019-05-03    5500.0
2019-05-04       NaN
dtype: float64

In [33]:
use_date_range = pd.Series([1, 2, 3, 4, 5,],
                          index = pd.date_range(start='1997-07-31', end='1997-08-04').tolist())

In [34]:
print(use_date_range)

1997-07-31    1
1997-08-01    2
1997-08-02    3
1997-08-03    4
1997-08-04    5
dtype: int64

In [45]:
three_month = pd.Series([i for i in range(1, 91)],
                         index = pd.date_range(start='2021-01-01', end='2021-03-31').tolist())

In [46]:
print(three_month)

2021-01-01     1
2021-01-02     2
2021-01-03     3
2021-01-04     4
2021-01-05     5
              ..
2021-03-27    86
2021-03-28    87
2021-03-29    88
2021-03-30    89
2021-03-31    90
Length: 90, dtype: int64

### DataFrame 이해

* pandas의 대표적인 기본 자료형
* seaborn의 데이터
    + seborn에 들어가는 기본적인 데이터 자료형은 pandas
* plotly에서도 pandas 호환

In [48]:
dat = {'col1':[1,2,3,4,],
       'col2':[10,20,30,40],
       'col3':['A', 'B', 'C', 'D']}
df = pd.DataFrame(dat)
df

   col1  col2 col3
0     1    10    A
1     2    20    B
2     3    30    C
3     4    40    D

In [96]:
dict_ex = {'이름':['A', 'B', 'C', 'D'],
           '월급':[100, 200, 300, 400]}
df_ex = pd.DataFrame(dict_ex)
df_ex

  이름   월급
0  A  100
1  B  200
2  C  300
3  D  400

In [86]:
d = {'A': {'x': 1, 'y': 1, 'k': 1}, 'B': {'y': 1, 'z': 1}}

In [87]:
ddf = pd.DataFrame(d)

In [88]:
ddf

     A    B
x  1.0  NaN
y  1.0  1.0
k  1.0  NaN
z  NaN  1.0

In [89]:
ddf.fillna(0)

     A    B
x  1.0  0.0
y  1.0  1.0
k  1.0  0.0
z  0.0  1.0

In [101]:
fav_music = pd.Series(['힙합', '클래식', 'EDM'])
fav_sport = pd.Series(['복싱', '러닝', '태권도', '테니스'])
my_fav = {'fav_music': fav_music, 'fav_sport': fav_sport}
fav_df = pd.DataFrame(my_fav)
fav_df

  fav_music fav_sport
0        힙합        복싱
1       클래식        러닝
2       EDM       태권도
3       NaN       테니스

In [228]:
team_score = { "toto":[1500,3000,5000,7000,5500],
               "apple":[4000,5000,6000,5500,4500],
               "gildong":[2000,2500,3000,4000,3000],
               "catanddog":[7000,5000,3000,5000,4000]}

team_df = pd.DataFrame(team_score)
team_df

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

In [108]:
# col로 선택
team_df['toto']

0    1500
1    3000
2    5000
3    7000
4    5500
Name: toto, dtype: int64

In [109]:
# col 여러개 선택
team_df[['toto', 'gildong']]

   toto  gildong
0  1500     2000
1  3000     2500
2  5000     3000
3  7000     4000
4  5500     3000

In [111]:
team_df.loc[ : , 'apple' : 'gildong']

   apple  gildong
0   4000     2000
1   5000     2500
2   6000     3000
3   5500     4000
4   4500     3000

In [126]:
team_df.loc[ 1:3 , ['toto', 'gildong']]

   toto  gildong
1  3000     2500
2  5000     3000
3  7000     4000

In [113]:
team_df.loc[ 1:3 , ['toto', 'gildong']]

   toto  gildong
1  3000     2500
2  5000     3000
3  7000     4000

In [114]:
team_df.loc[ [0, 4] , ['toto', 'gildong']]

   toto  gildong
0  1500     2000
4  5500     3000

In [115]:
team_df.loc[ : , ['gildong']]

   gildong
0     2000
1     2500
2     3000
3     4000
4     3000

In [120]:
team_df.loc[ : ,'gildong']

0    2000
1    2500
2    3000
3    4000
4    3000
Name: gildong, dtype: int64

In [121]:
team_df.loc[ : , ['gildong', 'catanddog']]

   gildong  catanddog
0     2000       7000
1     2500       5000
2     3000       3000
3     4000       5000
4     3000       4000

In [123]:
team_score1 = { "toto":[1500,3000,5000,7000,5500],
               "apple":[4000,5000,6000,5500,4500],
               "gildong":[2000,2500,3000,4000,3000],
               "catanddog":[7000,5000,3000,5000,4000]}

team_df1 = pd.DataFrame(team_score, index=["a", "b", "c", 'd', 'e'])
team_df1

   toto  apple  gildong  catanddog
a  1500   4000     2000       7000
b  3000   5000     2500       5000
c  5000   6000     3000       3000
d  7000   5500     4000       5000
e  5500   4500     3000       4000

In [138]:
team_df1.loc['a':'c', 'toto':'apple']

   toto  apple
a  1500   4000
b  3000   5000
c  5000   6000

In [148]:
team_df1['toto':'apple']

Empty DataFrame
Columns: [toto, apple, gildong, catanddog]
Index: []

In [149]:
team_df[['toto','apple']]

   toto  apple
0  1500   4000
1  3000   5000
2  5000   6000
3  7000   5500
4  5500   4500

TypeError: cannot do slice indexing on Index with these indexers [0] of type int

In [153]:
team_df1.iloc[0:2, : ]

   toto  apple  gildong  catanddog
a  1500   4000     2000       7000
b  3000   5000     2500       5000

In [155]:
team_df1.iloc[1:2, 2:3]

   gildong
b     2500

In [163]:
team_df.iloc[1:3, 1:4:2]

   apple  catanddog
1   5000       5000
2   6000       3000

In [259]:
idx_date = pd.date_range(start="2020-01-01",end="2020-01-05").tolist()
team_df.index = idx_date
team_df

            toto  apple  gildong  catanddog  row_sum  row_mean  row_median
2020-01-01  1500   4000     2000       7000    14500    3625.0      3000.0
2020-01-02  3000   5000     2500       5000    15500    3875.0      4000.0
2020-01-03  5000   6000     3000       3000    17000    4250.0      4000.0
2020-01-04  7000   5500     4000       5000    21500    5375.0      5250.0
2020-01-05  5500   4500     3000       4000    17000    4250.0      4250.0

In [169]:
print(team_df.loc[ '2020-01-02' ] ) # 19-05-02 일
print("-----------")
print(team_df.loc[ ['2020-01-02', '2020-01-03'] ]) # 5월 2일, 3일 
print("-----------")
print(team_df.loc[ '2020-01-02': ])  # 5월 2일 이후 전체 데이터 가져오기

toto         3000
apple        5000
gildong      2500
catanddog    5000
Name: 2020-01-02 00:00:00, dtype: int64
-----------
            toto  apple  gildong  catanddog
2020-01-02  3000   5000     2500       5000
2020-01-03  5000   6000     3000       3000
-----------
            toto  apple  gildong  catanddog
2020-01-02  3000   5000     2500       5000
2020-01-03  5000   6000     3000       3000
2020-01-04  7000   5500     4000       5000
2020-01-05  5500   4500     3000       4000

In [170]:
## 컬럼명 확인 
print(team_df.columns)
print("-----")
print(team_df.loc[:, 'toto'])   # 전체행, toto팀 
print("-----")
print(team_df.loc[:, ['toto', 'gildong'] ])   # 전체행, toto, gildong팀
print("-----")
print(team_df.loc[:, 'toto': ])   # 전체행, toto 부터 끝까지

Index(['toto', 'apple', 'gildong', 'catanddog'], dtype='object')
-----
2020-01-01    1500
2020-01-02    3000
2020-01-03    5000
2020-01-04    7000
2020-01-05    5500
Name: toto, dtype: int64
-----
            toto  gildong
2020-01-01  1500     2000
2020-01-02  3000     2500
2020-01-03  5000     3000
2020-01-04  7000     4000
2020-01-05  5500     3000
-----
            toto  apple  gildong  catanddog
2020-01-01  1500   4000     2000       7000
2020-01-02  3000   5000     2500       5000
2020-01-03  5000   6000     3000       3000
2020-01-04  7000   5500     4000       5000
2020-01-05  5500   4500     3000       4000

In [171]:
print(team_df.iloc[0])      # 첫번째 행 접근
print("------")
print(team_df.iloc[ [0,1] ])  # 첫번째 두번째 행 접근
print("------")
print(team_df.iloc[ 0:3:1] )  # 첫번째부터 세번째 행 접근
print("------")
range_num = list(range(0,3,1))
print(team_df.iloc[ range_num ] )  # 첫번째부터 세번째 행 접근

toto         1500
apple        4000
gildong      2000
catanddog    7000
Name: 2020-01-01 00:00:00, dtype: int64
------
            toto  apple  gildong  catanddog
2020-01-01  1500   4000     2000       7000
2020-01-02  3000   5000     2500       5000
------
            toto  apple  gildong  catanddog
2020-01-01  1500   4000     2000       7000
2020-01-02  3000   5000     2500       5000
2020-01-03  5000   6000     3000       3000
------
            toto  apple  gildong  catanddog
2020-01-01  1500   4000     2000       7000
2020-01-02  3000   5000     2500       5000
2020-01-03  5000   6000     3000       3000

### 일반 통계 - 합, 평균, 표준편차, ...

In [225]:
team_df

            toto  apple  gildong  catanddog   row_sum
2020-01-01  1500   4000     2000       7000   72500.0
2020-01-02  3000   5000     2500       5000   77500.0
2020-01-03  5000   6000     3000       3000   85000.0
2020-01-04  7000   5500     4000       5000  107500.0
2020-01-05  5500   4500     3000       4000   85000.0

In [174]:
team_df.sum()

toto         22000
apple        25000
gildong      14500
catanddog    24000
dtype: int64

In [175]:
team_df.sum(axis=0)

toto         22000
apple        25000
gildong      14500
catanddog    24000
dtype: int64

In [177]:
team_df.sum(axis=1) # axis=0 col, axis=1 row

2020-01-01    14500
2020-01-02    15500
2020-01-03    17000
2020-01-04    21500
2020-01-05    17000
dtype: int64

#### 통계량 구하기

In [180]:
team_df.mean()

toto         4400.0
apple        5000.0
gildong      2900.0
catanddog    4800.0
dtype: float64

In [184]:
team_df.std()

toto         2162.174831
apple         790.569415
gildong       741.619849
catanddog    1483.239697
dtype: float64

In [185]:
team_df.median()

toto         5000.0
apple        5000.0
gildong      3000.0
catanddog    5000.0
dtype: float64

In [186]:
team_df.count()

toto         5
apple        5
gildong      5
catanddog    5
dtype: int64

In [187]:
team_df.rank()

            toto  apple  gildong  catanddog
2020-01-01   1.0    1.0      1.0        5.0
2020-01-02   2.0    3.0      2.0        3.5
2020-01-03   3.0    5.0      3.5        1.0
2020-01-04   5.0    4.0      5.0        3.5
2020-01-05   4.0    2.0      3.5        2.0

In [188]:
team_df.var()

toto         4675000.0
apple         625000.0
gildong       550000.0
catanddog    2200000.0
dtype: float64

In [189]:
team_df.min()

toto         1500
apple        4000
gildong      2000
catanddog    3000
dtype: int64

In [190]:
team_df.max()

toto         7000
apple        6000
gildong      4000
catanddog    7000
dtype: int64

In [191]:
team_df.corr()

               toto     apple   gildong  catanddog
toto       1.000000  0.621582  0.966628  -0.631427
apple      0.621582  1.000000  0.639602  -0.746203
gildong    0.966628  0.639602  1.000000  -0.477273
catanddog -0.631427 -0.746203 -0.477273   1.000000

In [192]:
team_df.cumsum()

             toto  apple  gildong  catanddog
2020-01-01   1500   4000     2000       7000
2020-01-02   4500   9000     4500      12000
2020-01-03   9500  15000     7500      15000
2020-01-04  16500  20500    11500      20000
2020-01-05  22000  25000    14500      24000

In [193]:
team_df.max().index

Index(['toto', 'apple', 'gildong', 'catanddog'], dtype='object')

In [195]:
team_df.count().values

array([5, 5, 5, 5], dtype=int64)

In [196]:
team_df.count().index

Index(['toto', 'apple', 'gildong', 'catanddog'], dtype='object')

In [209]:
team_df.loc[:,['apple', 'catanddog']]

            apple  catanddog
2020-01-01   4000       7000
2020-01-02   5000       5000
2020-01-03   6000       3000
2020-01-04   5500       5000
2020-01-05   4500       4000

In [210]:
team_df.loc[:,['apple', 'catanddog']].sum()

apple        25000
catanddog    24000
dtype: int64

In [211]:
team_df.loc[:,['apple', 'catanddog']].mean()

apple        5000.0
catanddog    4800.0
dtype: float64

In [223]:
team_df.loc[:,['apple', 'catanddog']].std()

apple         790.569415
catanddog    1483.239697
dtype: float64

In [260]:
team_df['row_sum'] = team_df.iloc[:, 0:4].sum(axis=1)
team_df

            toto  apple  gildong  catanddog  row_sum  row_mean  row_median
2020-01-01  1500   4000     2000       7000    14500    3625.0      3000.0
2020-01-02  3000   5000     2500       5000    15500    3875.0      4000.0
2020-01-03  5000   6000     3000       3000    17000    4250.0      4000.0
2020-01-04  7000   5500     4000       5000    21500    5375.0      5250.0
2020-01-05  5500   4500     3000       4000    17000    4250.0      4250.0

In [261]:
team_df.cumsum()

             toto  apple  gildong  catanddog  row_sum  row_mean  row_median
2020-01-01   1500   4000     2000       7000    14500    3625.0      3000.0
2020-01-02   4500   9000     4500      12000    30000    7500.0      7000.0
2020-01-03   9500  15000     7500      15000    47000   11750.0     11000.0
2020-01-04  16500  20500    11500      20000    68500   17125.0     16250.0
2020-01-05  22000  25000    14500      24000    85500   21375.0     20500.0

In [262]:
team_df['row_mean'] = team_df.iloc[:, 0:4].mean(axis=1)
team_df

            toto  apple  gildong  catanddog  row_sum  row_mean  row_median
2020-01-01  1500   4000     2000       7000    14500    3625.0      3000.0
2020-01-02  3000   5000     2500       5000    15500    3875.0      4000.0
2020-01-03  5000   6000     3000       3000    17000    4250.0      4000.0
2020-01-04  7000   5500     4000       5000    21500    5375.0      5250.0
2020-01-05  5500   4500     3000       4000    17000    4250.0      4250.0

In [263]:
team_df.sort_values('row_mean', ascending=False)

            toto  apple  gildong  catanddog  row_sum  row_mean  row_median
2020-01-04  7000   5500     4000       5000    21500    5375.0      5250.0
2020-01-03  5000   6000     3000       3000    17000    4250.0      4000.0
2020-01-05  5500   4500     3000       4000    17000    4250.0      4250.0
2020-01-02  3000   5000     2500       5000    15500    3875.0      4000.0
2020-01-01  1500   4000     2000       7000    14500    3625.0      3000.0

In [264]:
team_df['row_median'] = team_df.iloc[:, 0:4].median(axis=1)
team_df

            toto  apple  gildong  catanddog  row_sum  row_mean  row_median
2020-01-01  1500   4000     2000       7000    14500    3625.0      3000.0
2020-01-02  3000   5000     2500       5000    15500    3875.0      4000.0
2020-01-03  5000   6000     3000       3000    17000    4250.0      4000.0
2020-01-04  7000   5500     4000       5000    21500    5375.0      5250.0
2020-01-05  5500   4500     3000       4000    17000    4250.0      4250.0

In [265]:
team_df.sort_values('row_median', ascending=False)

            toto  apple  gildong  catanddog  row_sum  row_mean  row_median
2020-01-04  7000   5500     4000       5000    21500    5375.0      5250.0
2020-01-05  5500   4500     3000       4000    17000    4250.0      4250.0
2020-01-02  3000   5000     2500       5000    15500    3875.0      4000.0
2020-01-03  5000   6000     3000       3000    17000    4250.0      4000.0
2020-01-01  1500   4000     2000       7000    14500    3625.0      3000.0

In [276]:
team_df[team_df['row_sum']>=15000]

            toto  apple  gildong  catanddog  row_sum  row_mean  row_median
2020-01-02  3000   5000     2500       5000    15500    3875.0      4000.0
2020-01-03  5000   6000     3000       3000    17000    4250.0      4000.0
2020-01-04  7000   5500     4000       5000    21500    5375.0      5250.0
2020-01-05  5500   4500     3000       4000    17000    4250.0      4250.0

In [278]:
team_df[(team_df['row_sum']>=15000) & (team_df['row_mean']>=4000)]

            toto  apple  gildong  catanddog  row_sum  row_mean  row_median
2020-01-03  5000   6000     3000       3000    17000    4250.0      4000.0
2020-01-04  7000   5500     4000       5000    21500    5375.0      5250.0
2020-01-05  5500   4500     3000       4000    17000    4250.0      4250.0

In [282]:
team_df[(team_df['row_sum']>=15000) & (team_df.index > '2020-01-03')]

            toto  apple  gildong  catanddog  row_sum  row_mean  row_median
2020-01-04  7000   5500     4000       5000    21500    5375.0      5250.0
2020-01-05  5500   4500     3000       4000    17000    4250.0      4250.0